app/controllers/members_controller.rb

  def login_post
    username = params[:username]
    password = params[:password]
    @member = Member.where(username: username).first
---
SELECT "members".* FROM "members" WHERE "members"."username" = 'Sue' LIMIT 1